src/DataProcessors/СтатистикаСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СтатистикаСделок</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦенРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЯндексКарты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЯндексКарты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторСтруктурнойЕдиницы</Name>
					<Comment>Необходим для онлайн-записи для выгрузки в reservi</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасписаниеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/СтатистикаСделок/Forms/Форма/Ext/Form/Module.bsl
#Область ПеременныеФормы

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;	// Параметры опроса завершения фонового задания. См. общий модуль ДлительныеОперацииКлиент

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере.
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	ОтборСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	Элементы.ВыбратьСтруктурнуюЕдиницу.Заголовок = ОтборСтруктурнаяЕдиница.Наименование;
	
	ОтборПериодТип = Перечисления.Периодичность.День;
	
	ОтборПериодЗначение.ДатаНачала = НачалоДня(ТекущаяДатаСеанса);
	ОтборПериодЗначение.ДатаНачала = КонецДня(ТекущаяДатаСеанса);
	ТекущийПериод = Истина;
	
	УстановитьПериодАгрегированияИнформацииНаСервере();
	
	КодОжиданиеЗагрузки = ПолучитьКодОжиданияЗагрузки();
	
КонецПроцедуры  

&НаКлиенте
// Процедура - При открытии.
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)
	
	Этаформа.ТекущийЭлемент = Элементы.ВыбратьСтруктурнуюЕдиницу;
		
	ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьФоновоеЗаданиеПриОткрытии", 0.1, Истина);

КонецПроцедуры


#КонецОбласти  

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Выбрать структурную единицу.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВыбратьСтруктурнуюЕдиницу(Команда)
	
	ОповещениеПриЗакрытии = Новый ОписаниеОповещения("ВыборСтруктурнойЕдиницыЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.Форма.ФормаВыбора",,,,,, ОповещениеПриЗакрытии);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура - Выбор структурной единицы завершение.
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ВыборСтруктурнойЕдиницыЗавершение(Результат, Параметры) Экспорт 
	
	Если Результат <> Неопределено И ТипЗнч(Результат) = Тип("СправочникСсылка.СтруктурныеЕдиницы") И ОтборСтруктурнаяЕдиница <> Результат Тогда		
		Элементы.ВыбратьСтруктурнуюЕдиницу.Заголовок = Строка(Результат);
		ОтборСтруктурнаяЕдиница = Результат;
		
		ОбновитьВиджетНаКлиенте();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Обновить виджет на клиенте.
//
Процедура ОбновитьВиджетНаКлиенте()
	
	ФоновоеЗаданиеВыполнено = Ложь;
	ФоновоеЗаданиеЗапущено = Истина;
	УправлениеФормой(ЭтотОбъект);
	
	ЗапуститьФоновоеЗаданиеНаСервере();
	НачатьОжиданиеЗавершенияФоновогоЗаданияНаКлиенте();
	
КонецПроцедуры

#Область _____________________УСТАНОВКА_ОТБОРА_ПО_ПЕРИОДУ________________________

&НаКлиенте
// Процедура - Установить период агрегирования информации
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УстановитьПериодАгрегированияИнформации(Команда)

	ОбновитьДанные 							= Истина;
	СдвинутьВременнойИнтервал 				= Ложь;
	НаправлениеДвиженияВременногоИнтервала 	= "";
	
	Если Команда.Имя = "УстановитьПериодПроизвольный" Тогда	
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();
		Диалог.Период = ОтборПериодЗначение;
		Диалог.Показать(Новый ОписаниеОповещения("ОтборПериодаПланированииПриИзменении", ЭтаФорма)); 
		ОбновитьДанные = Ложь;
	ИначеЕсли Команда.Имя = "ПериодВперед" Тогда
		СдвинутьВременнойИнтервал 				= Истина;
		НаправлениеДвиженияВременногоИнтервала 	= "Вперед";
	ИначеЕсли Команда.Имя = "ПериодНазад" Тогда
		СдвинутьВременнойИнтервал 				= Истина;
		НаправлениеДвиженияВременногоИнтервала 	= "Назад";		
	КонецЕсли;
	
	Если ОбновитьДанные Тогда 
		УстановитьПериодАгрегированияИнформацииНаСервере(Команда.Имя, СдвинутьВременнойИнтервал, НаправлениеДвиженияВременногоИнтервала, ОбновитьДанные);
		ОбновитьВиджетНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Отбор периода планировании при изменении
//
// Параметры:
//  Результат				 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ОтборПериодаПланированииПриИзменении(Результат, ДополнительныеПараметры) Экспорт 
	
	Если НЕ Результат = Неопределено Тогда
		ОтборПериодТип 		= ПредопределенноеЗначение("Перечисление.Периодичность.Час");
		
		Если Не ЗначениеЗаполнено(Результат.ДатаНачала) Тогда
			Результат.ДатаНачала = Дата("20010101");					
		КонецЕсли;  
		
		Если Не ЗначениеЗаполнено(Результат.ДатаОкончания) Тогда
			Результат.ДатаОкончания = КонецГода(ТекущаяДатаСеанса);					
		КонецЕсли;
		
		ОтборПериодЗначение = Результат;
		УстановитьПериодАгрегированияИнформацииНаСервере(, , , Истина);
		ОбновитьВиджетНаКлиенте();
	Иначе 
		// УстановитьФокусЭлементаСервер();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Установить период агрегирования информации на сервере
//
// Параметры:
//  КомандаПериода							 - 	 - 
//  СдвинутьВременнойИнтервал				 - 	 - 
//  НаправлениеДвиженияВременногоИнтервала	 - 	 - 
//  ОбновитьДанные							 - 	 - 
//
Процедура УстановитьПериодАгрегированияИнформацииНаСервере(Знач КомандаПериода = Неопределено, Знач СдвинутьВременнойИнтервал = Ложь, Знач НаправлениеДвиженияВременногоИнтервала = "", ОбновитьДанные = Ложь)
	
	Если КомандаПериода = Неопределено И ЗначениеЗаполнено(ОтборПериодТип) Тогда 
		// При открытии формы на сервере
	Иначе 
		Если КомандаПериода = "УстановитьПериодДень" Тогда 
			ОтборПериодТип 	= Перечисления.Периодичность.День;
		ИначеЕсли КомандаПериода = "УстановитьПериодНеделя" Тогда
			ОтборПериодТип 	= Перечисления.Периодичность.Неделя;
		ИначеЕсли КомандаПериода = "УстановитьПериодМесяц" Тогда	
			ОтборПериодТип = Перечисления.Периодичность.Месяц;
		ИначеЕсли КомандаПериода = "УстановитьПериодПроизвольный" Тогда	
			ОтборПериодТип = Перечисления.Периодичность.Час;			
		ИначеЕсли НЕ СдвинутьВременнойИнтервал Тогда  
			ОтборПериодТип = Перечисления.Периодичность.День;
		КонецЕсли; 
		
		ТекущийПериод = ?(СдвинутьВременнойИнтервал Или КомандаПериода = "УстановитьПериодПроизвольный", Ложь, Истина)

	КонецЕсли;
	СформироватьЗначениеПериодаОтбора(СдвинутьВременнойИнтервал, НаправлениеДвиженияВременногоИнтервала);
	
	УстановитьСвойстваОтображенияЭлементовПериода();
		
КонецПроцедуры

&НаСервере
// Процедура - Сформировать значение периода отбора
//
Процедура СформироватьЗначениеПериодаОтбора(СдвинутьВременнойИнтервал = Ложь, НаправлениеДвиженияВременногоИнтервала = "")
	
	Если СдвинутьВременнойИнтервал Тогда 
		Если НаправлениеДвиженияВременногоИнтервала = "Вперед" Тогда 
			Если ОтборПериодТип = Перечисления.Периодичность.День Тогда
				ОтборПериодЗначение.ДатаНачала 		= НачалоДня(ОтборПериодЗначение.ДатаНачала + 60*60*24);
				ОтборПериодЗначение.ДатаОкончания 	= КонецДня(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда
				ОтборПериодЗначение.ДатаНачала 		= НачалоНедели(ОтборПериодЗначение.ДатаНачала + 60*60*24*7);
				ОтборПериодЗначение.ДатаОкончания 	= КонецНедели(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда
				ОтборПериодЗначение.ДатаНачала 		= НачалоМесяца(ДобавитьМесяц(ОтборПериодЗначение.ДатаНачала, 1));
				ОтборПериодЗначение.ДатаОкончания 	= КонецМесяца(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Час Тогда
				Если НачалоМесяца(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаНачала И КонецМесяца(ОтборПериодЗначение.ДатаОкончания) = ОтборПериодЗначение.ДатаОкончания Тогда 
					ОтборПериодЗначение.ДатаНачала 		= НачалоМесяца(ДобавитьМесяц(ОтборПериодЗначение.ДатаНачала, 1));
					ОтборПериодЗначение.ДатаОкончания 	= КонецМесяца(ОтборПериодЗначение.ДатаНачала);
				Иначе 					
					ПериодВСекундах 					= ОтборПериодЗначение.ДатаОкончания - ОтборПериодЗначение.ДатаНачала;
					ОтборПериодЗначение.ДатаНачала 		= ОтборПериодЗначение.ДатаОкончания + 1;
					ОтборПериодЗначение.ДатаОкончания 	= ОтборПериодЗначение.ДатаНачала + ПериодВСекундах;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли НаправлениеДвиженияВременногоИнтервала = "Назад" Тогда	
			Если ОтборПериодТип = Перечисления.Периодичность.День Тогда
				ОтборПериодЗначение.ДатаНачала 		= НачалоДня(ОтборПериодЗначение.ДатаНачала - 60*60*24);
				ОтборПериодЗначение.ДатаОкончания 	= КонецДня(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда
				ОтборПериодЗначение.ДатаНачала 		= НачалоНедели(ОтборПериодЗначение.ДатаНачала - 60*60*24*7);
				ОтборПериодЗначение.ДатаОкончания 	= КонецНедели(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда 
				ОтборПериодЗначение.ДатаНачала 		= НачалоМесяца(ДобавитьМесяц(ОтборПериодЗначение.ДатаНачала, -1));
				ОтборПериодЗначение.ДатаОкончания 	= КонецМесяца(ОтборПериодЗначение.ДатаНачала);
			ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Час Тогда
				Если НачалоМесяца(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаНачала И КонецМесяца(ОтборПериодЗначение.ДатаОкончания) = ОтборПериодЗначение.ДатаОкончания Тогда 
					ОтборПериодЗначение.ДатаНачала 		= НачалоМесяца(ДобавитьМесяц(ОтборПериодЗначение.ДатаНачала, -1));
					ОтборПериодЗначение.ДатаОкончания 	= КонецМесяца(ОтборПериодЗначение.ДатаНачала);
				Иначе 	
					ПериодВСекундах 					= ОтборПериодЗначение.ДатаОкончания - ОтборПериодЗначение.ДатаНачала;
					ОтборПериодЗначение.ДатаОкончания 	= ОтборПериодЗначение.ДатаНачала - 1;
					ОтборПериодЗначение.ДатаНачала 		= ОтборПериодЗначение.ДатаОкончания - ПериодВСекундах;				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе 	
		Если ОтборПериодТип = Перечисления.Периодичность.День Тогда 
			ОтборПериодЗначение.Вариант 			= ВариантСтандартногоПериода.Сегодня; 
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда
			ОтборПериодЗначение.Вариант 			= ВариантСтандартногоПериода.ЭтаНеделя;
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда
			ОтборПериодЗначение.Вариант 			= ВариантСтандартногоПериода.ЭтотМесяц;
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Час Тогда
			// формируется в асинхронном вызове
		КонецЕсли;	
	КонецЕсли;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиДляМонитораРуководителя", "ОтборПериодЗначение"	, ОтборПериодЗначение); 
    ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиДляМонитораРуководителя", "ОтборПериодТип"		, ОтборПериодТип); 
КонецПроцедуры

&НаСервере
// Процедура - Установить видимость элементов
//
Процедура УстановитьСвойстваОтображенияЭлементовПериода()
	
	// Управление свойствами элементов-переключателей устанавливающих отбор по периоду
	Для Каждого ЭлементГруппаПереключательПериода Из Элементы.ГруппаОтборПоПериоду.ПодчиненныеЭлементы Цикл 
		ЭлементГруппаПереключательПериода.ЦветФона = Новый Цвет();
		Если ТипЗнч(ЭлементГруппаПереключательПериода) = Тип("ГруппаФормы") Тогда 
			Для Каждого ЭлементКнопкаПереключательПериода Из ЭлементГруппаПереключательПериода.ПодчиненныеЭлементы Цикл
				Если ТипЗнч(ЭлементКнопкаПереключательПериода) = Тип("КнопкаФормы") Тогда
					Если НЕ ЭлементКнопкаПереключательПериода.Имя = "УстановитьПериодПроизвольный" Тогда 
						ЭлементКнопкаПереключательПериода.ЦветТекста = Новый Цвет(127, 127, 127);
					КонецЕсли;	
				ИначеЕсли ТипЗнч(ЭлементКнопкаПереключательПериода) = Тип("ДекорацияФормы") Тогда
					ЭлементКнопкаПереключательПериода.ЦветФона = Новый Цвет(242, 242, 242);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;
	
	Если ОтборПериодТип = Перечисления.Периодичность.День И ТекущийПериод Тогда
		// Элементы.ГруппаКнопкиУстановитьПериодДень.ЦветФона 			= Новый Цвет(242, 242, 242);		
		Элементы.УстановитьПериодДень.ЦветТекста 						= Новый Цвет();
		Элементы.ДекорацияУказательВыбранныеПериодДень.ЦветФона 		= Новый Цвет(100, 177, 230); 
	ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Неделя И ТекущийПериод Тогда
		// Элементы.ГруппаКнопкиУстановитьПериодНеделя.ЦветФона 			= Новый Цвет(242, 242, 242);		
		Элементы.УстановитьПериодНеделя.ЦветТекста 						= Новый Цвет();
		Элементы.ДекорацияУказательВыбранныеПериодНеделя.ЦветФона 		= Новый Цвет(100, 177, 230); 
	ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Месяц И ТекущийПериод Тогда
		// Элементы.ГруппаКнопкиУстановитьПериодМесяц.ЦветФона 			= Новый Цвет(242, 242, 242);		
		Элементы.УстановитьПериодМесяц.ЦветТекста 						= Новый Цвет();
		Элементы.ДекорацияУказательВыбранныеПериодМесяц.ЦветФона 		= Новый Цвет(100, 177, 230); 
	ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Час Или Не ТекущийПериод Тогда
		// Элементы.ГруппаКнопкиУстановитьПериодПроизвольный.ЦветФона 	= Новый Цвет(242, 242, 242);		
		Элементы.УстановитьПериодПроизвольный.ЦветТекста 				= Новый Цвет();
		Элементы.ДекорацияУказательВыбранныеПериодПроизвольный.ЦветФона = Новый Цвет(100, 177, 230); 
	КонецЕсли;
	
	// Формируем текст периода
	КомандаВыбораПроизвольногоПериода = ЭтаФорма.Команды.Найти("УстановитьПериодПроизвольный");
	Если ОтборПериодЗначение.ДатаНачала = Дата(1,1,1) И ОтборПериодЗначение.ДатаОкончания = Дата(1,1,1) Тогда 
		Элементы.УстановитьПериодПроизвольный.Заголовок = Нстр("ru='< не указан >';en='< not specified >'");
		Если НЕ КомандаВыбораПроизвольногоПериода = Неопределено Тогда 
			КомандаВыбораПроизвольногоПериода.Подсказка = Нстр("ru='Щелкните для выбора произвольного периода';en='Click for of choice arbitrary period'");
		КонецЕсли;	
	Иначе
		Если ОтборПериодТип = Перечисления.Периодичность.День Тогда 
			Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ='д ММММ гггг'");
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Неделя Тогда	
			Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=d.MM.yy") + " - " + Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yy");
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Месяц Тогда	
			Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ='ММММ гггг'");
		ИначеЕсли ОтборПериодТип = Перечисления.Периодичность.Час Тогда  // Произвольный
			Если ЗначениеЗаполнено(ОтборПериодЗначение.ДатаНачала) И ЗначениеЗаполнено(ОтборПериодЗначение.ДатаОкончания) Тогда
				Если НачалоДня(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаНачала И КонецДня(ОтборПериодЗначение.ДатаОкончания) = ОтборПериодЗначение.ДатаОкончания И КонецДня(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаОкончания Тогда 
					Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ='д ММММ гггг'");				
				ИначеЕсли НачалоМесяца(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаНачала И КонецМесяца(ОтборПериодЗначение.ДатаОкончания) = ОтборПериодЗначение.ДатаОкончания И КонецМесяца(ОтборПериодЗначение.ДатаНачала) = ОтборПериодЗначение.ДатаОкончания Тогда 
					Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ='ММММ гггг'");
				Иначе 	
					Элементы.УстановитьПериодПроизвольный.Заголовок = Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=d.MM.yy") + " - " + Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=dd.MM.yy");			
				КонецЕсли;	
			Иначе 
				Если НЕ ЗначениеЗаполнено(ОтборПериодЗначение.ДатаНачала) Тогда 
					Элементы.УстановитьПериодПроизвольный.Заголовок = Нстр("ru='по ';en='to '") + Формат(ОтборПериодЗначение.ДатаОкончания, "ДФ=d.MM.yy");			
				ИначеЕсли НЕ ЗначениеЗаполнено(ОтборПериодЗначение.ДатаОкончания) Тогда 	
					Элементы.УстановитьПериодПроизвольный.Заголовок = Нстр("ru='с ';en='from '") + Формат(ОтборПериодЗначение.ДатаНачала, "ДФ=d.MM.yy");			
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли; 	
		Если НЕ КомандаВыбораПроизвольногоПериода = Неопределено Тогда 
			КомандаВыбораПроизвольногоПериода.Подсказка = Элементы.УстановитьПериодПроизвольный.Заголовок;
		КонецЕсли;			
	КонецЕсли;	
	
	// УстановитьФокусЭлементаСервер();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти 

#Область ФоновоеЗаданиеПолучениеДанных

&НаКлиенте
// Процедура - Подключаемый запустить фоновое задание при открытии.
//
Процедура Подключаемый_ЗапуститьФоновоеЗаданиеПриОткрытии()
	
	ЗапуститьФоновоеЗаданиеНаСервере();
	НачатьОжиданиеЗавершенияФоновогоЗаданияНаКлиенте();
	
КонецПроцедуры 

&НаСервере 
// Процедура - Запустить фоновое задание на сервере.
//
Процедура ЗапуститьФоновоеЗаданиеНаСервере()
	
	// Монопольный режим Или фоновое задание было запущено раньше, необходимо дождаться завершения.
  	Если МонопольныйРежим() Или (ФоновоеЗаданиеЗапущено И НЕ ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор)) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДатаСеанса = ТекущаяДатаСеанса();
	
	// Параметры обернем в структуру для их передачи через механизм ДлительныеОперации.
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница);
	ПараметрыПроцедуры.Вставить("ПериодРасчета"		, ОтборПериодЗначение);     
	ПараметрыПроцедуры.Вставить("ОтборПериодТип"	, ОтборПериодТип);
	
	НаименованиеЗадания = НСтр("ru='Обновление виджета статистика воронок.';en='Funnel statistics widget update'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Обработки.СтатистикаСделок.ПолучитьДанныеВоронок",
		ПараметрыПроцедуры,
		НаименованиеЗадания);
	
	ФоновоеЗаданиеАдресРезультата = Результат.АдресХранилища;
	ФоновоеЗаданиеИдентификатор   = Результат.ИдентификаторЗадания;
	
	// Если фоновое задание завершилось за время вызова, то данные уже получены
	Если Результат.ЗаданиеВыполнено Тогда
		ОбновитьОтображениеВиджета();
		ФоновоеЗаданиеВыполнено = Истина;
		ФоновоеЗаданиеЗапущено = Ложь;
	Иначе
		// иначе начнем ожидания завершения фонового задания
		ФоновоеЗаданиеЗапущено = Истина;
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры  

&НаКлиенте 
// Процедура - Начать ожидание завершения фонового задания на клиенте.
//
Процедура НачатьОжиданиеЗавершенияФоновогоЗаданияНаКлиенте()
	
	Если ФоновоеЗаданиеЗапущено Тогда
		// Начнем опрос окончания фонового задания
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьЗавершениеДлительнойОперации",
			ПараметрыОбработчикаОжидания.ТекущийИнтервал,
			Истина);
	КонецЕсли;
	
КонецПроцедуры
                                                                    
&НаКлиенте
// Процедура - Подключаемый проверить завершение длительной операции.
//
Процедура Подключаемый_ПроверитьЗавершениеДлительнойОперации()
	
	Если ФоновоеЗаданиеЗапущено Тогда
		
		Если ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор) Тогда
			// Данные расчитаны, обновим данные формы
			ФоновоеЗаданиеЗапущено = Ложь;
			ФоновоеЗаданиеВыполнено = Истина;
			ОбновитьОтображениеВиджета();
			УправлениеФормой(ЭтотОбъект);
		Иначе
			// Продолжим ожидание
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьЗавершениеДлительнойОперации",
				ПараметрыОбработчикаОжидания.ТекущийИнтервал,
				Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервереБезКонтекста
// Функция - Задание выполнено.
//
// Параметры:
//  ИдентификаторЗадания - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

#КонецОбласти

#Область УправлениеФормойИЭлементами
                                                           	
&НаКлиентеНаСервереБезКонтекста
// Процедура - Управление формой.
//
// Параметры:
//  Форма	 - 	 - 
//
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ФоновоеЗаданиеВыполнено Тогда
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВиджет;
	Иначе
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОжидание;
	КонецЕсли;
	
	Элементы.ГруппаФильтров.Доступность = НЕ Форма.ФоновоеЗаданиеЗапущено;
		
КонецПроцедуры

#КонецОбласти 

#Область ОтображениеДанных

&НаСервере
// Процедура - Обновить отображение виджета.
//
Процедура ОбновитьОтображениеВиджета()
		
	// Получим подготовленные в фоновом задании данные.
	ДанныеВиджета = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресРезультата);
	//ДанныеВиджета = Новый Соответствие();
	Если ДанныеВиджета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Блок левая колонка воронки первичных пациентов.
	Элементы.ДекорацияНовыйОбращенияКоличество.Заголовок 				= ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ОбщееКоличествоПервичных", 0);
	Элементы.ДекорацияНадписьКоличествоКачественныхОбращений.Заголовок	= ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "КоличествоКачественныхЗаявок", 0);
	Элементы.ДекорацияПроцентКачественныхОбращений.Заголовок			= "" + ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПроцентКачественныхЗаявок", 0) + " %";
    Элементы.ДекорацияКлиентЗаписанКоличество.Заголовок                 = ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "КоличествоПервичныеЗаписано", 0);
	Элементы.ДекорацияКлиентЗаписанПроцент.Заголовок					= "" + ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПроцентПервичныхПациентовЗаписано", 0) + " %";
	Элементы.ДекорацияКлиентПодтвердилКоличество.Заголовок				= ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "КоличествоПервичныеПодтвердило", 0);
	Элементы.ДекорацияКлиентПодтвердилПроцент.Заголовок					= "" + ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПроцентПервичныхПациентовПодтвердило", 0) + " %";
	Элементы.ДекорацияКлиентПришелКоличество.Заголовок					= ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "КоличествоПервичныеПришло", 0);
	Элементы.ДекорацияКлиентПришелПроцент.Заголовок						= "" + ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПроцентПервичныхПациентовПришло", 0) + " %";
	Элементы.ДекорацияКлиентОтменилКоличество.Заголовок					= "" + ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "КоличествоПервичныеОтказ", 0);
	Элементы.ДекорацияПотериПроцент.Заголовок							= "" + ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПроцентПервичныхПациентовОтказ", 0) + " %";
	Элементы.ДекорацияВремяОбработки.Заголовок							= ПолучитьВремяВФорматеПродолжительности(ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "СреднееВремяОбработкиЗаявок", 0));

	// Блок праваяколонка воронки первичных пациентов.
	Элементы.ДекорацияСреднееВремяОбращенияДоЗаписиКоличество.Заголовок 	= ПолучитьВремяВФорматеПродолжительности(ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПервичныеСреднееВремяОтСозданияЗаявкиДоЗаписи", 0));
	Элементы.ДекорацияСреднееВремяОтзаписиДоПриемаКоличество.Заголовок 		= ПолучитьВремяВФорматеПродолжительности(ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПервичныеСреднееВремяОтЗаписиДоПриема", 0));
	Элементы.ДекорацияСреднееВремяОтОбращенияДоПриемаКоличество.Заголовок 	= ПолучитьВремяВФорматеПродолжительности(ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПервичныеСреднееВремяОтСозданияЗаявкиДоПриема", 0)); 
		
	// Блок левая колонка воронки постоянных пациентов.
	Элементы.ДекорацияПотенциальнаяЗаписьКоличество.Заголовок 			= ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ОбщееКоличествоПвторных", 0); 
	Элементы.ДекорацияПредложениеОзвученоКоличество.Заголовок			= ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "КоличествоПовторныеПредложениеОзвучено", 0);
	Элементы.ДекорацияПредложениеОзвученоПроцент.Заголовок				= "" + ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПроцентПостоянныхПредложениеОзвучено", 0) + " %";
	Элементы.ДекорацияКлиентЗаписанПовторныеКоличество.Заголовок        = ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "КоличествоПовторныеЗаписано", 0);
	Элементы.ДекорацияКлиентЗаписанПовторныеПроцент.Заголовок			= "" + ПолучитьЗначениеИзСоответствия(ДанныеВиджета,"ПроцентПостоянныхЗаписано", 0) + " %"; 
	Элементы.ДекорацияКлиентПодтвердилПовторныеКоличество.Заголовок		= ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "КоличествоПовторныеПодтвердило", 0);
	Элементы.ДекорацияКлиентПодтвердилПовторныеПроцент.Заголовок		= "" + ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПроцентПостоянныхПодтвердило", 0) + " %";
	Элементы.ДекорацияКлиентПришелПовторныеКоличество.Заголовок			= ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "КоличествоПовторныеПришло", 0);
	Элементы.ДекорацияКлиентПришелПовторныеПроцент.Заголовок			= "" + ПолучитьЗначениеИзСоответствия(ДанныеВиджета,"ПроцентПостоянныхПришло", 0) + " %"; 	
    Элементы.ДекорацияКлиентОтмененоПовторныеКоличество.Заголовок       = ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "КоличествоПовторныеОтказ", 0); 
	Элементы.ДекорацияПотериПовторныеКоличество.Заголовок				= "" + ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПроцентПостоянныхОтказ", 0) + " %";

	// Блок праваяколонка воронки первичных пациентов.
	Элементы.ДекорацияСреднееВремяОтЗаписиДоЗаписиКоличество.Заголовок 			= ПолучитьВремяВФорматеПродолжительности(ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПовторныеСреднееВремяОтПотенциальногоПриемаДоЗаписи", 0));
	Элементы.ДекорацияСреднееВремяОтЗаписиДоПриемаПовторныеКоличество.Заголовок = ПолучитьВремяВФорматеПродолжительности(ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПовторныеСреднееВремяОтЗаписиДоПриема", 0));
	Элементы.ДекорацияСреднееВремОтОборащенияДоПриемаКоличество.Заголовок 		= ПолучитьВремяВФорматеПродолжительности(ПолучитьЗначениеИзСоответствия(ДанныеВиджета, "ПовторныеСреднееВремяОтПотенциальногоПриемаДоПриема", 0)); 
	
	ЗадатьПропорциональныеВеличиныЭлементов();

КонецПроцедуры  

&НаСервереБезКонтекста
// Функция - Получить код ожидания загрузки.
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКодОжиданияЗагрузки()
	
	Текст = "
	|<!DOCTYPE html>
	|<html>
	|<head>
	|<meta name=""viewport"" content=""width=device-width, initial-scale=1"">
	|<style>
	|.loader {
	|border: 16px solid #f3f3f3;
	|border-radius: 50%;
	|border-top: 16px solid #8286f1;
	|width: 60px;
	|height: 60px;
	|-webkit-animation: spin 2s linear infinite; / Safari /
	|animation: spin 2s linear infinite;
	|}
	|/ Safari /
	|@-webkit-keyframes spin {
	|0% { -webkit-transform: rotate(0deg); }
	|100% { -webkit-transform: rotate(360deg); }
	|}
	|@keyframes spin {
	|0% { transform: rotate(0deg); }
	|100% { transform: rotate(360deg); }
	|}
	|.new {display: flex;justify-content: center;align-items: center;height: 100%;}
	|</style>
	|</head>
	|<body>
	|<div class=""new"">
	|<div class=""loader""></div></div>
	|</body>
	|</html>";
	
	Возврат Текст;
	
Конецфункции

&НаСервереБезКонтекста 
// Процедура - Установить форматы временных элементов формы.
//
Функция ПолучитьВремяВФорматеПродолжительности(КоличествоМинут)
	
		
	Если КоличествоМинут = Неопределено Или КоличествоМинут = 0 Тогда
		Возврат "0 минут";
	КонецЕсли;
	
	Если КоличествоМинут >= 1440 Тогда // - дней - часов
		КоличествоДней = Цел(КоличествоМинут / 1440);
		КоличествоЧасов = Цел(Окр(((КоличествоМинут - (КоличествоДней * 1440))/60), 0)); 
		
		Если КоличествоДней > 0 Тогда		
			ДниСтрокой = СтрокаСЧислом(";%1 день;;%1 дня;%1 дней;%1 дня", КоличествоДней, ВидЧисловогоЗначения.Количественное, "L=ru");
		Иначе
			ДниСтрокой = "";
		КонецЕсли;
		
		Если КоличествоЧасов > 0 Тогда
			ЧасыСтрокой = СтрокаСЧислом(";%1 час;%1 часов;%1 часа;%1 часов;%1 часа", КоличествоЧасов, ВидЧисловогоЗначения.Количественное, "L=ru");
		Иначе
			ЧасыСтрокой = "";
		КонецЕсли;
	
		Возврат СтрШаблон("%1 %2", ДниСтрокой, ЧасыСтрокой); 
		
	ИначеЕсли КоличествоМинут >= 60 Тогда 
		
		КоличествоЧасов = Цел(КоличествоМинут / 60); 
		КоличествоМинут = Цел((КоличествоМинут - (КоличествоЧасов * 60)));
		
		Если КоличествоЧасов > 0 Тогда
			ЧасыСтрокой = СтрокаСЧислом(";%1 час;%1 часов;%1 часа;%1 часов;%1 часа", КоличествоЧасов, ВидЧисловогоЗначения.Количественное, "L=ru");
		Иначе
			ЧасыСтрокой = "";
		КонецЕсли;
		
		Если КоличествоМинут > 0 Тогда
			МинутыСтрокой = СтрокаСЧислом(";%1 минута;%1 минут;%1 минуты;%1 минут;%1 минуты", КоличествоМинут, ВидЧисловогоЗначения.Количественное, "L=ru");
		Иначе
			МинутыСтрокой = "";
		КонецЕсли;
	
		Возврат СтрШаблон("%1 %2", ЧасыСтрокой, МинутыСтрокой);
		
	КонецЕсли;
	
	Если КоличествоМинут > 0 Тогда
		МинутыСтрокой = СтрокаСЧислом(";%1 минута;%1 минут;%1 минуты;%1 минут;%1 минуты", КоличествоМинут, ВидЧисловогоЗначения.Количественное, "L=ru");
	Иначе
		МинутыСтрокой = "";
	КонецЕсли;
	
	Возврат МинутыСтрокой; 

		
КонецФункции

&НаСервере
// Процедура - Задать пропорциональные величины элементов.
//
Процедура ЗадатьПропорциональныеВеличиныЭлементов()
	
	СтруктураПараметров = Новый Структура();   
	СтруктураПараметров.Вставить("МаксимальныйПоказательКоличество"	, Число(Элементы.ДекорацияНовыйОбращенияКоличество.Заголовок));
	СтруктураПараметров.Вставить("МаксимальныйПоказательШирины"		, Элементы.ГруппаНовыеОбращенияИнформация.Ширина);
	СтруктураПараметров.Вставить("МинимальныйПоказательШирины"		, 24);
	
	// Для начала все группы с одинаковым максимумом.
	ЗадатьШиринуГруппы(Элементы.ГруппаКачественныеОбращенияИнф	, Число(Элементы.ДекорацияНадписьКоличествоКачественныхОбращений.Заголовок)	, СтруктураПараметров);	
	
	СтруктураПараметров.Вставить("МинимальныйПоказательШирины"		, 18);

  	ЗадатьШиринуГруппы(Элементы.ГруппаКлиентЗаписан				, Число(Элементы.ДекорацияКлиентЗаписанКоличество.Заголовок)				, СтруктураПараметров);
	ЗадатьШиринуГруппы(Элементы.ГруппаКлиентПодтвердил			, Число(Элементы.ДекорацияКлиентПодтвердилКоличество.Заголовок)				, СтруктураПараметров); 
	
	//СтруктураПараметров.Вставить("МаксимальныйПоказательКоличество"	, Число(Элементы.ДекорацияПотенциальнаяЗаписьКоличество.Заголовок));
	
	ЗадатьШиринуГруппы(Элементы.ГруппаПредложениеОзвучено		, Число(Элементы.ДекорацияПредложениеОзвученоКоличество.Заголовок)			, СтруктураПараметров); 		
	ЗадатьШиринуГруппы(Элементы.ГруппаКлиентЗаписанПовторные	, Число(Элементы.ДекорацияКлиентЗаписанПовторныеКоличество.Заголовок)		, СтруктураПараметров); 
	ЗадатьШиринуГруппы(Элементы.ГруппаКлиентПодтвердилПовторные	, Число(Элементы.ДекорацияКлиентПодтвердилПовторныеКоличество.Заголовок)	, СтруктураПараметров); 
	
	СтруктураПараметров.Вставить("МаксимальныйПоказательШирины"		, Элементы.ГруппаНовыеОбращенияИнформация.Ширина - 18); 	
	
	Если Число(Элементы.ДекорацияКлиентПришелКоличество.Заголовок) < Число(Элементы.ДекорацияКлиентПодтвердилКоличество.Заголовок) Тогда 
		СтруктураПараметров.Вставить("МинимальныйПоказательШирины"		, 14);                                                                   
	КонецЕсли;
	
	СтруктураПараметров.Вставить("МаксимальныйПоказательКоличество"	, Число(Элементы.ДекорацияКлиентПришелКоличество.Заголовок) + Число(Элементы.ДекорацияКлиентОтменилКоличество.Заголовок));
	
    ЗадатьШиринуГруппы(Элементы.ГруппаКлиентПришел	, Число(Элементы.ДекорацияКлиентПришелКоличество.Заголовок)	, СтруктураПараметров);
	
	СтруктураПараметров.Вставить("МаксимальныйПоказательШирины"		, 50 - Элементы.ГруппаКлиентПришел.Ширина);
	ЗадатьШиринуГруппы(Элементы.ГруппаПотери		, Число(Элементы.ДекорацияКлиентОтменилКоличество.Заголовок), СтруктураПараметров);
	
	СтруктураПараметров.Вставить("МаксимальныйПоказательШирины"		, Элементы.ГруппаНовыеОбращенияИнформация.Ширина - 18); 
	
	Если Число(Элементы.ДекорацияКлиентПришелПовторныеКоличество.Заголовок) >= Число(Элементы.ДекорацияКлиентПодтвердилПовторныеКоличество.Заголовок) Тогда 
		СтруктураПараметров.Вставить("МинимальныйПоказательШирины"		, 18);                                                                   
	КонецЕсли;
	СтруктураПараметров.Вставить("МаксимальныйПоказательКоличество"	, Число(Элементы.ДекорацияКлиентПришелПовторныеКоличество.Заголовок) + Число(Элементы.ДекорацияКлиентОтмененоПовторныеКоличество.Заголовок));
	
	ЗадатьШиринуГруппы(Элементы.ГруппаКлиентПришелПостоянные, Число(Элементы.ДекорацияКлиентПришелПовторныеКоличество.Заголовок)	, СтруктураПараметров);	

	СтруктураПараметров.Вставить("МаксимальныйПоказательШирины"		, 50 - Элементы.ГруппаКлиентПришелПостоянные.Ширина);
	ЗадатьШиринуГруппы(Элементы.ГруппаПотериПовторные		, Число(Элементы.ДекорацияКлиентОтмененоПовторныеКоличество.Заголовок)	, СтруктураПараметров);	

КонецПроцедуры  

&НаСервере
// Процедура - Зада ширин группы.
//
// Параметры:
//  Группа							 - 	 - 
//  МаксимальноеЗначениеШирина		 - 	 - 
//  МаксимальноеЗначениеКоличество	 - 	 - 
//  КоличественныйПоказатель		 - 	 - 
//
Процедура ЗадатьШиринуГруппы(Группа, КоличественныйПоказатель, СтруктураПараметров)
		
	МаксимальныйПоказательКоличество 	= 0;
	МаксимальныйПоказательШирины		= 0;	
	МинимальныйПоказательШирины			= 0;
	ЗначениеПромежуточное   			= 0;
	
	СтруктураПараметров.Свойство("МаксимальныйПоказательКоличество"	, МаксимальныйПоказательКоличество);
	СтруктураПараметров.Свойство("МаксимальныйПоказательШирины"		, МаксимальныйПоказательШирины);
	СтруктураПараметров.Свойство("МинимальныйПоказательШирины"		, МинимальныйПоказательШирины);	
	
	Если МаксимальныйПоказательКоличество <> 0 Тогда 	
		ЗначениеПромежуточное = Окр((КоличественныйПоказатель / МаксимальныйПоказательКоличество) * МаксимальныйПоказательШирины, 0);	
	КонецЕсли; 
	
	ШиринаПромежуточный = Макс(ЗначениеПромежуточное, МинимальныйПоказательШирины); 	
	Группа.Ширина = Мин(ШиринаПромежуточный, МаксимальныйПоказательШирины);     

КонецПроцедуры  

&НаСервере 
// Функция - Получить значение из соответствия.
//
// Параметры:
//  Соответствие		 - 	 - 
//  Ключ				 - 	 - 
//  ЗначениеПоУмолчанию	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЗначениеИзСоответствия(Соответствие, Ключ, ЗначениеПоУмолчанию)

	ЗначениеСоответствия = Соответствие.Получить(Ключ);
	Возврат ?(ЗначениеСоответствия = Неопределено, ЗначениеПоУмолчанию, ЗначениеСоответствия); 
		
КонецФункции

#КонецОбласти
